# 1. Pandas Basics

In [1]:
import pandas as pd
from matplotlib import pyplot as plt
plt.style.use('ggplot')

> DataFrame is like a python dictionary

In [2]:
web_stats = { 'Day' : [1,2,3,4],
              'Visitors' : [43,53,34,45],
              'Bounce_rate' : [65,72,62,64]
            }
df = pd.DataFrame(web_stats)
df

   Bounce_rate  Day  Visitors
0           65    1        43
1           72    2        53
2           62    3        34
3           64    4        45

In [3]:
df.head(2)

   Bounce_rate  Day  Visitors
0           65    1        43
1           72    2        53

### Why do we have a index?

**How your data is related?** For example, time series data has time as index.

In [4]:
# setting index
df.set_index('Day')

     Bounce_rate  Visitors
Day
1             65        43
2             72        53
3             62        34
4             64        45

**In-place operation**

In [5]:
df.set_index('Day',inplace=True)
df

     Bounce_rate  Visitors
Day
1             65        43
2             72        53
3             62        34
4             64        45

### To reference a specific column

In [7]:
df['Visitors']

Day
1    43
2    53
3    34
4    45
Name: Visitors, dtype: int64

In [16]:
# also
df.Visitors

Day
1    43
2    53
3    34
4    45
Name: Visitors, dtype: int64

### Reference multiple columns

In [18]:
df[['Bounce_rate','Visitors']]

     Bounce_rate  Visitors
Day
1             65        43
2             72        53
3             62        34
4             64        45

### Convert DataFrame to list

In [19]:
df.Visitors.tolist()

[43, 53, 34, 45]

### Convert more than one column to a numpy array

In [20]:
import numpy as np
np.array(df[['Visitors', 'Bounce_rate']])

array([[43, 65],
       [53, 72],
       [34, 62],
       [45, 64]])

### Convert numpy array to DataFrame

In [21]:
pd.DataFrame(np.array([[1,2],[3,4]]))

   0  1
0  1  2
1  3  4

_____________________________________________________________________________________________

# 2. Pandas IO

In [34]:
df = pd.read_csv('../data/housing.csv')
df.head()

         Date     Value
0  2016-06-30  2.861789
1  2016-05-31  2.943012
2  2015-12-31  3.394777
3  2015-10-31  2.487805
4  2015-09-30  3.629032

In [26]:
# set index as Date
df.set_index('Date',inplace=True)

### Save to csv

In [27]:
df.to_csv('../data/date_indexed_housing.csv')

In [28]:
# read again
df = pd.read_csv('../data/date_indexed_housing.csv')
df

         Date     Value
0  2016-06-30  2.861789
1  2016-05-31  2.943012
2  2015-12-31  3.394777
3  2015-10-31  2.487805
4  2015-09-30  3.629032
5  2015-08-31  3.137682

### Set index column while reading

In [35]:
df = pd.read_csv('../data/date_indexed_housing.csv',index_col=0)
df

               Value
Date
2016-06-30  2.861789
2016-05-31  2.943012
2015-12-31  3.394777
2015-10-31  2.487805
2015-09-30  3.629032
2015-08-31  3.137682

### Set column name

In [36]:
df.columns = ['Home Price Index']
df

            Home Price Index
Date
2016-06-30          2.861789
2016-05-31          2.943012
2015-12-31          3.394777
2015-10-31          2.487805
2015-09-30          3.629032
2015-08-31          3.137682

In [37]:
# save again
df.to_csv('../data/new_data.csv')

In [38]:
# save without column header names
df.to_csv('../data/new_data_no_header.csv', header=False)

### Read a file without column names and manually insert column names

In [40]:
df = pd.read_csv('../data/new_data_no_header.csv',names=['Date','House Pricing'], index_col=0) # set index also
df

            House Pricing
Date
2016-06-30       2.861789
2016-05-31       2.943012
2015-12-31       3.394777
2015-10-31       2.487805
2015-09-30       3.629032
2015-08-31       3.137682

### Convert to HTML

In [43]:
df.to_html('../data/housing.html')

### Remove index

In [45]:
df.reset_index(inplace=True)
df

         Date  House Pricing
0  2016-06-30       2.861789
1  2016-05-31       2.943012
2  2015-12-31       3.394777
3  2015-10-31       2.487805
4  2015-09-30       3.629032
5  2015-08-31       3.137682

### Rename columns

In [47]:
df.rename( columns= {'Housing Pricing' : 'HPI'}, inplace=True)

In [48]:
df

         Date  House Pricing
0  2016-06-30       2.861789
1  2016-05-31       2.943012
2  2015-12-31       3.394777
3  2015-10-31       2.487805
4  2015-09-30       3.629032
5  2015-08-31       3.137682

_____________________________________________________________________________________________

# 3. Building Dataset

In [3]:
import quandl as Q
api_key = open('../quandl.key','r').read()[:-1]

In [5]:
df = Q.get('FMAC/HPI_AK', authtoken=api_key)
df.head()

                Value
Date
1975-01-31  34.429922
1975-02-28  34.940483
1975-03-31  35.463028
1975-04-30  36.008230
1975-05-31  36.603608

### Read a list of data, from html

In [6]:
wiki_content = pd.read_html('https://simple.wikipedia.org/wiki/List_of_U.S._states')
wiki_content

[               0               1               2                  3
 0   Abbreviation      State Name         Capital     Became a State
 1             AL         Alabama      Montgomery  December 14, 1819
 2             AK          Alaska          Juneau    January 3, 1959
 3             AZ         Arizona         Phoenix  February 14, 1912
 4             AR        Arkansas     Little Rock      June 15, 1836
 5             CA      California      Sacramento  September 9, 1850
 6             CO        Colorado          Denver     August 1, 1876
 7             CT     Connecticut        Hartford    January 9, 1788
 8             DE        Delaware           Dover   December 7, 1787
 9             FL         Florida     Tallahassee      March 3, 1845
 10            GA         Georgia         Atlanta    January 2, 1788
 11            HI          Hawaii        Honolulu    August 21, 1959
 12            ID           Idaho           Boise       July 3, 1890
 13            IL        Illinois     Springfield   December 3, 1818
 14            IN         Indiana    Indianapolis  December 11, 1816
 15            IA            Iowa      Des Moines  December 28, 1846
 16            KS          Kansas          Topeka   January 29, 1861
 17            KY        Kentucky       Frankfort       June 1, 1792
 18            LA       Louisiana     Baton Rouge     April 30, 1812
 19            ME           Maine         Augusta     March 15, 1820
 20            MD        Maryland       Annapolis     April 28, 1788
 21            MA   Massachusetts          Boston   February 6, 1788
 22            MI        Michigan         Lansing   January 26, 1837
 23            MN       Minnesota      Saint Paul       May 11, 1858
 24            MS     Mississippi         Jackson  December 10, 1817
 25            MO        Missouri  Jefferson City    August 10, 1821
 26            MT         Montana          Helena   November 8, 1889
 27            NE        Nebraska         Lincoln      March 1, 1867
 28            NV          Nevada     Carson City   October 31, 1864
 29            NH   New Hampshire         Concord      June 21, 1788
 30            NJ      New Jersey         Trenton  December 18, 1787
 31            NM      New Mexico        Santa Fe    January 6, 1912
 32            NY        New York          Albany      July 26, 1788
 33            NC  North Carolina         Raleigh  November 21, 1789
 34            ND    North Dakota        Bismarck   November 2, 1889
 35            OH            Ohio        Columbus      March 1, 1803
 36            OK        Oklahoma   Oklahoma City  November 16, 1907
 37            OR          Oregon           Salem  February 14, 1859
 38            PA    Pennsylvania      Harrisburg  December 12, 1787
 39            RI    Rhode Island      Providence       May 19, 1790
 40            SC  South Carolina        Columbia       May 23, 1788
 41            SD    South Dakota          Pierre   November 2, 1889
 42            TN       Tennessee       Nashville       June 1, 1796
 43            TX           Texas          Austin  December 29, 1845
 44            UT            Utah  Salt Lake City    January 4, 1896
 45            VT         Vermont      Montpelier      March 4, 1791
 46            VA        Virginia        Richmond      June 25, 1788
 47            WA      Washington         Olympia  November 11, 1889
 48            WV   West Virginia      Charleston      June 20, 1863
 49            WI       Wisconsin         Madison       May 29, 1848
 50            WY         Wyoming        Cheyenne      July 10, 1890,
                                                   0   \
 0  v t e Political divisions of the United States...
 1     v t e Political divisions of the United States
 2                                                NaN
 3                                             States
 4                                                NaN
 5                                   National capital
 6                                                NaN
 7                                      Large islands
 8                                                NaN
 9                                      Small islands

                                                   1   2       3   \
 0     v t e Political divisions of the United States NaN  States
 1                                                NaN NaN     NaN
 2                                                NaN NaN     NaN
 3  Alabama · Alaska · Arizona · Arkansas · Califo... NaN     NaN
 4                                                NaN NaN     NaN
 5                               District of Columbia NaN     NaN
 6                                                NaN NaN     NaN
 7  American Samoa · Guam · Northern Mariana Islan... NaN     NaN
 8                                                NaN NaN     NaN
 9  Baker Island · Howland Island · Jarvis Island ... NaN     NaN

                                                   4   5                 6   \
 0  Alabama · Alaska · Arizona · Arkansas · Califo... NaN  National capital
 1                                                NaN NaN               NaN
 2                                                NaN NaN               NaN
 3                                                NaN NaN               NaN
 4                                                NaN NaN               NaN
 5                                                NaN NaN               NaN
 6                                                NaN NaN               NaN
 7                                                NaN NaN               NaN
 8                                                NaN NaN               NaN
 9                                                NaN NaN               NaN

                      7   8              9   \
 0  District of Columbia NaN  Large islands
 1                   NaN NaN            NaN
 2                   NaN NaN            NaN
 3                   NaN NaN            NaN
 4                   NaN NaN            NaN
 5                   NaN NaN            NaN
 6                   NaN NaN            NaN
 7                   NaN NaN            NaN
 8                   NaN NaN            NaN
 9                   NaN NaN            NaN

                                                   10  11             12  \
 0  American Samoa · Guam · Northern Mariana Islan... NaN  Small islands
 1                                                NaN NaN            NaN
 2                                                NaN NaN            NaN
 3                                                NaN NaN            NaN
 4                                                NaN NaN            NaN
 5                                                NaN NaN            NaN
 6                                                NaN NaN            NaN
 7                                                NaN NaN            NaN
 8                                                NaN NaN            NaN
 9                                                NaN NaN            NaN

                                                   13
 0  Baker Island · Howland Island · Jarvis Island ...
 1                                                NaN
 2                                                NaN
 3                                                NaN
 4                                                NaN
 5                                                NaN
 6                                                NaN
 7                                                NaN
 8                                                NaN
 9                                                NaN  ,
                                                 0  \
 0  v t e Political divisions of the United States
 1                                             NaN
 2                                          States
 3                                             NaN
 4                                National capital
 5                                             NaN
 6                                   Large islands
 7                                             NaN
 8                                   Small islands

                                                    1
 0                                                NaN
 1                                                NaN
 2  Alabama · Alaska · Arizona · Arkansas · Califo...
 3                                                NaN
 4                               District of Columbia
 5                                                NaN
 6  American Samoa · Guam · Northern Mariana Islan...
 7                                                NaN
 8  Baker Island · Howland Island · Jarvis Island ...  ]

In [7]:
wiki_content[0]

               0               1               2                  3
0   Abbreviation      State Name         Capital     Became a State
1             AL         Alabama      Montgomery  December 14, 1819
2             AK          Alaska          Juneau    January 3, 1959
3             AZ         Arizona         Phoenix  February 14, 1912
4             AR        Arkansas     Little Rock      June 15, 1836
5             CA      California      Sacramento  September 9, 1850
6             CO        Colorado          Denver     August 1, 1876
7             CT     Connecticut        Hartford    January 9, 1788
8             DE        Delaware           Dover   December 7, 1787
9             FL         Florida     Tallahassee      March 3, 1845
10            GA         Georgia         Atlanta    January 2, 1788
11            HI          Hawaii        Honolulu    August 21, 1959
12            ID           Idaho           Boise       July 3, 1890
13            IL        Illinois     Springfield   December 3, 1818
14            IN         Indiana    Indianapolis  December 11, 1816
15            IA            Iowa      Des Moines  December 28, 1846
16            KS          Kansas          Topeka   January 29, 1861
17            KY        Kentucky       Frankfort       June 1, 1792
18            LA       Louisiana     Baton Rouge     April 30, 1812
19            ME           Maine         Augusta     March 15, 1820
20            MD        Maryland       Annapolis     April 28, 1788
21            MA   Massachusetts          Boston   February 6, 1788
22            MI        Michigan         Lansing   January 26, 1837
23            MN       Minnesota      Saint Paul       May 11, 1858
24            MS     Mississippi         Jackson  December 10, 1817
25            MO        Missouri  Jefferson City    August 10, 1821
26            MT         Montana          Helena   November 8, 1889
27            NE        Nebraska         Lincoln      March 1, 1867
28            NV          Nevada     Carson City   October 31, 1864
29            NH   New Hampshire         Concord      June 21, 1788
30            NJ      New Jersey         Trenton  December 18, 1787
31            NM      New Mexico        Santa Fe    January 6, 1912
32            NY        New York          Albany      July 26, 1788
33            NC  North Carolina         Raleigh  November 21, 1789
34            ND    North Dakota        Bismarck   November 2, 1889
35            OH            Ohio        Columbus      March 1, 1803
36            OK        Oklahoma   Oklahoma City  November 16, 1907
37            OR          Oregon           Salem  February 14, 1859
38            PA    Pennsylvania      Harrisburg  December 12, 1787
39            RI    Rhode Island      Providence       May 19, 1790
40            SC  South Carolina        Columbia       May 23, 1788
41            SD    South Dakota          Pierre   November 2, 1889
42            TN       Tennessee       Nashville       June 1, 1796
43            TX           Texas          Austin  December 29, 1845
44            UT            Utah  Salt Lake City    January 4, 1896
45            VT         Vermont      Montpelier      March 4, 1791
46            VA        Virginia        Richmond      June 25, 1788
47            WA      Washington         Olympia  November 11, 1889
48            WV   West Virginia      Charleston      June 20, 1863
49            WI       Wisconsin         Madison       May 29, 1848
50            WY         Wyoming        Cheyenne      July 10, 1890

Now that we have a dataframe of all states, lets get the *Abbreviation* column

In [8]:
wiki_content[0][0]

0     Abbreviation
1               AL
2               AK
3               AZ
4               AR
5               CA
6               CO
7               CT
8               DE
9               FL
10              GA
11              HI
12              ID
13              IL
14              IN
15              IA
16              KS
17              KY
18              LA
19              ME
20              MD
21              MA
22              MI
23              MN
24              MS
25              MO
26              MT
27              NE
28              NV
29              NH
30              NJ
31              NM
32              NY
33              NC
34              ND
35              OH
36              OK
37              OR
38              PA
39              RI
40              SC
41              SD
42              TN
43              TX
44              UT
45              VT
46              VA
47              WA
48              WV
49              WI
50              WY
Name: 0, dtype: object

In [9]:
for abbv in wiki_content[0][0][1:]:
    print('FMAC/HPI_{}'.format(abbv))

FMAC/HPI_AL
FMAC/HPI_AK
FMAC/HPI_AZ
FMAC/HPI_AR
FMAC/HPI_CA
FMAC/HPI_CO
FMAC/HPI_CT
FMAC/HPI_DE
FMAC/HPI_FL
FMAC/HPI_GA
FMAC/HPI_HI
FMAC/HPI_ID
FMAC/HPI_IL
FMAC/HPI_IN
FMAC/HPI_IA
FMAC/HPI_KS
FMAC/HPI_KY
FMAC/HPI_LA
FMAC/HPI_ME
FMAC/HPI_MD
FMAC/HPI_MA
FMAC/HPI_MI
FMAC/HPI_MN
FMAC/HPI_MS
FMAC/HPI_MO
FMAC/HPI_MT
FMAC/HPI_NE
FMAC/HPI_NV
FMAC/HPI_NH
FMAC/HPI_NJ
FMAC/HPI_NM
FMAC/HPI_NY
FMAC/HPI_NC
FMAC/HPI_ND
FMAC/HPI_OH
FMAC/HPI_OK
FMAC/HPI_OR
FMAC/HPI_PA
FMAC/HPI_RI
FMAC/HPI_SC
FMAC/HPI_SD
FMAC/HPI_TN
FMAC/HPI_TX
FMAC/HPI_UT
FMAC/HPI_VT
FMAC/HPI_VA
FMAC/HPI_WA
FMAC/HPI_WV
FMAC/HPI_WI
FMAC/HPI_WY

# Concatenate and Append Dataframes

In [10]:
df1 = pd.DataFrame( {'HPI' : [80,85,88,85],
                     'Int_rate' : [2,3,2,2],
                     'US_GDP_Thousands' : [50,55,65,55]
                    }, index = [2001,2002,2003,2004])
df2 = pd.DataFrame( {'HPI' : [80,85,88,85],
                     'Int_rate' : [2,3,2,2],
                     'US_GDP_Thousands' : [50,55,65,55]
                    }, index = [2005,2006,2007,2008])
df3 = pd.DataFrame( {'HPI' : [80,85,88,85],
                     'Int_rate' : [2,3,2,2],
                     'Low_tier_HPI' : [50,52,50,53]
                    }, index = [2001,2002,2003,2004])

In [11]:
concat = pd.concat([df1,df2])
concat

      HPI  Int_rate  US_GDP_Thousands
2001   80         2                50
2002   85         3                55
2003   88         2                65
2004   85         2                55
2005   80         2                50
2006   85         3                55
2007   88         2                65
2008   85         2                55

In [12]:
pd.concat([df1,df2,df3])

      HPI  Int_rate  Low_tier_HPI  US_GDP_Thousands
2001   80         2           NaN              50.0
2002   85         3           NaN              55.0
2003   88         2           NaN              65.0
2004   85         2           NaN              55.0
2005   80         2           NaN              50.0
2006   85         3           NaN              55.0
2007   88         2           NaN              65.0
2008   85         2           NaN              55.0
2001   80         2          50.0               NaN
2002   85         3          52.0               NaN
2003   88         2          50.0               NaN
2004   85         2          53.0               NaN

## Append

In [13]:
df4 = df1.append(df2)
df4

      HPI  Int_rate  US_GDP_Thousands
2001   80         2                50
2002   85         3                55
2003   88         2                65
2004   85         2                55
2005   80         2                50
2006   85         3                55
2007   88         2                65
2008   85         2                55

In [14]:
df1.append(df3)

      HPI  Int_rate  Low_tier_HPI  US_GDP_Thousands
2001   80         2           NaN              50.0
2002   85         3           NaN              55.0
2003   88         2           NaN              65.0
2004   85         2           NaN              55.0
2001   80         2          50.0               NaN
2002   85         3          52.0               NaN
2003   88         2          50.0               NaN
2004   85         2          53.0               NaN

### Use a series instead

In [15]:
s = pd.Series([80,2,50])
df4 = df1.append(s, ignore_index=True)
df4

    HPI  Int_rate  US_GDP_Thousands     0    1     2
0  80.0       2.0              50.0   NaN  NaN   NaN
1  85.0       3.0              55.0   NaN  NaN   NaN
2  88.0       2.0              65.0   NaN  NaN   NaN
3  85.0       2.0              55.0   NaN  NaN   NaN
4   NaN       NaN               NaN  80.0  2.0  50.0

In [16]:
s = pd.Series([80,2,50], index = ['HPI','Int_rate', 'US_GDP_Thousands'])
df4 = df1.append(s,ignore_index=True)
df4

   HPI  Int_rate  US_GDP_Thousands
0   80         2                50
1   85         3                55
2   88         2                65
3   85         2                55
4   80         2                50

# Joining and Merging DataFrames

> one cares about the index and the other doesn't. which does what?

## Merge

In [17]:
pd.merge(df1,df2,on='HPI') # merge on HPI

   HPI  Int_rate_x  US_GDP_Thousands_x  Int_rate_y  US_GDP_Thousands_y
0   80           2                  50           2                  50
1   85           3                  55           3                  55
2   85           3                  55           2                  55
3   85           2                  55           3                  55
4   85           2                  55           2                  55
5   88           2                  65           2                  65

In [18]:
pd.merge(df1,df2,on=['HPI','Int_rate'])

   HPI  Int_rate  US_GDP_Thousands_x  US_GDP_Thousands_y
0   80         2                  50                  50
1   85         3                  55                  55
2   88         2                  65                  65
3   85         2                  55                  55

> Note that we have lost the index

## Join

In [20]:
df1 = pd.DataFrame( {'HPI' : [80,85,88,85],
                     'Int_rate' : [2,3,2,2],
                     'US_GDP_Thousands' : [50,55,65,55]
                    }, index = [2001,2002,2003,2004])
df2 = pd.DataFrame( {'HPI' : [80,85,88,85],
                     'Int_rate' : [2,3,2,2],
                     'US_GDP_Thousands' : [50,55,65,55]
                    }, index = [2005,2006,2007,2008])
df3 = pd.DataFrame( {'HPI' : [80,85,88,85],
                     'Unemployment' : [7,8,9,6],
                     'Low_tier_HPI' : [50,52,50,53]
                    }, index = [2001,2002,2003,2004])

In [21]:
df1.set_index('HPI', inplace=True)
df3.set_index('HPI', inplace=True)

In [22]:
df1.join(df3)

     Int_rate  US_GDP_Thousands  Low_tier_HPI  Unemployment
HPI
80          2                50            50             7
85          3                55            52             8
85          3                55            53             6
85          2                55            52             8
85          2                55            53             6
88          2                65            50             9

In [23]:
df1 = pd.DataFrame( {'Year' : [2001,2002,2003,2004],
                     'Int_rate' : [2,3,2,2],
                     'US_GDP_Thousands' : [50,55,65,55]
                    })
df2 = pd.DataFrame( {'Year' : [2001, 2003, 2004, 2005],
                     'Unemployment' : [7,8,9,6],
                     'Low_tier_HPI' : [50,52,50,53]
                    })

In [26]:
merged = pd.merge(df1,df2, on = 'Year')

In [27]:
merged.set_index('Year', inplace=True)
merged

      Int_rate  US_GDP_Thousands  Low_tier_HPI  Unemployment
Year
2001         2                50            50             7
2003         2                65            52             8
2004         2                55            50             9

In [28]:
pd.merge(df1,df2, on = 'Year', how='left')

   Int_rate  US_GDP_Thousands  Year  Low_tier_HPI  Unemployment
0         2                50  2001          50.0           7.0
1         3                55  2002           NaN           NaN
2         2                65  2003          52.0           8.0
3         2                55  2004          50.0           9.0

In [29]:
pd.merge(df1,df2, on ='Year', how='right')

   Int_rate  US_GDP_Thousands    Year  Low_tier_HPI  Unemployment
0       2.0              50.0  2001.0            50             7
1       2.0              65.0  2003.0            52             8
2       2.0              55.0  2004.0            50             9
3       NaN               NaN  2005.0            53             6

In [30]:
pd.merge(df1,df2, on='Year', how='outer')

   Int_rate  US_GDP_Thousands    Year  Low_tier_HPI  Unemployment
0       2.0              50.0  2001.0          50.0           7.0
1       3.0              55.0  2002.0           NaN           NaN
2       2.0              65.0  2003.0          52.0           8.0
3       2.0              55.0  2004.0          50.0           9.0
4       NaN               NaN  2005.0          53.0           6.0

In [31]:
pd.merge(df1,df2,on='Year', how='inner') # Default

   Int_rate  US_GDP_Thousands  Year  Low_tier_HPI  Unemployment
0         2                50  2001            50             7
1         2                65  2003            52             8
2         2                55  2004            50             9

> In join, the index is honored!

# Pickling